## Sales Data Analysis: Uncovering Trends and Insights from a Real-World Sales Dataset

In todayâ€™s competitive market, data-driven decision-making is crucial for businesses to optimize their sales strategies. Sales data contains valuable insights that can help organizations understand customer behavior, identify seasonal trends, and improve overall performance. By analyzing a real-world sales dataset, businesses can make informed decisions to boost revenue and enhance customer satisfaction.

## Objective

Your analysis in this mini project will focus on cleaning, exploring, and visualizing a sales dataset to extract meaningful insights using python and data visualization libraries.

## About the Dataset

The **[dataset](https://drive.google.com/file/d/1V6HTxMsNQswvL_K39UWB7dh8Un8f4oz7/view?usp=sharing)** used in this analysis is a real-world sales dataset containing transaction records from a retail business. It includes the following key features:

- `OrderID`: The id of the order that was placed.
- `Date`: The date the order was placed.
- `CustomerID`: The customer ID that represents the customer who made the purchase.
- `Product`: The class of product that was purchased.
- `Quantity`: The quantity of the product that was purchased.
- `Price`: Unit price of the product in dollars.
- `Total`: The total cost of the purchase in dollars.

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_csv("Dataset.csv")
df.head()

   OrderID        Date CustomerID  Product  Quantity  Price    Total
0        1  2024-04-12       C002    Phone         1    600   642.09
1        2  2024-12-14       C003   Laptop         2   1000  2098.39
2        3  2024-09-27       C017  Monitor         1    200   196.34
3        4  2024-04-16       C005    Phone         3    600  1955.86
4        5  2024-03-12       C017   Laptop         1   1000  1098.19

# Data Cleaning

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   OrderID     200 non-null    int64
 1   Date        200 non-null    object
 2   CustomerID  200 non-null    object
 3   Product     190 non-null    object
 4   Quantity    200 non-null    int64
 5   Price       200 non-null    int64
 6   Total       194 non-null    float64
dtypes: float64(1), int64(3), object(3)
memory usage: 11.1+ KB

In [4]:
df.isnull().sum()

OrderID        0
Date           0
CustomerID     0
Product       10
Quantity       0
Price          0
Total          6
dtype: int64

In [5]:
P_map = {600:'Phone', 1000:'Laptop', 200:'Monitor', 400:'Tablet', 100:'Headphones'}

df['Product'] = df['Product'].fillna(df['Price'].map(P_map))

df[df["Product"].isnull()]

Empty DataFrame
Columns: [OrderID, Date, CustomerID, Product, Quantity, Price, Total]
Index: []

In [6]:
df['Total'] = df['Total'].fillna(df['Quantity']*df['Price'])

df[df["Total"].isnull()]

Empty DataFrame
Columns: [OrderID, Date, CustomerID, Product, Quantity, Price, Total]
Index: []

In [7]:
df.isnull().sum()

OrderID       0
Date          0
CustomerID    0
Product       0
Quantity      0
Price         0
Total         0
dtype: int64

In [8]:
df[df.duplicated()]

Empty DataFrame
Columns: [OrderID, Date, CustomerID, Product, Quantity, Price, Total]
Index: []

In [9]:
df['Date'] = pd.to_datetime(df['Date'], format='%Y-%m-%d')

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   OrderID     200 non-null    int64
 1   Date        200 non-null    datetime64[ns]
 2   CustomerID  200 non-null    object
 3   Product     200 non-null    object
 4   Quantity    200 non-null    int64
 5   Price       200 non-null    int64
 6   Total       200 non-null    float64
dtypes: datetime64[ns](1), float64(1), int64(3), object(2)
memory usage: 11.1+ KB

In [10]:
df.to_csv("Clean_Dataset.csv", index=False)

# Exploratory Analysis

In [11]:
df.describe()

          OrderID                 Date   Quantity        Price        Total
count  200.000000                  200  200.00000   200.000000   200.000000
mean   100.500000  2024-07-06 23:09:36    1.36500   676.000000   933.009550
min      1.000000  2024-01-02 00:00:00    1.00000   100.000000    93.310000
25%     50.750000  2024-04-08 18:00:00    1.00000   400.000000   564.002500
50%    100.500000  2024-07-09 12:00:00    1.00000   600.000000   838.350000
75%    150.250000  2024-09-27 18:00:00    2.00000  1000.000000  1062.367500
max    200.000000  2024-12-29 00:00:00    3.00000  1000.000000  3293.240000
std     57.879185                  NaN    0.61943   300.291316   647.446344

In [12]:
df.describe(include='object')

       CustomerID Product
count         200     200
unique         20       5
top          C003  Laptop
freq           17      81

In [13]:
# Sales Count of products

df['Product'].value_counts()

Product
Laptop        81
Phone         63
Tablet        31
Monitor       15
Headphones    10
Name: count, dtype: int64

In [16]:
# Top 10 Customers

df['CustomerID'].value_counts()[:10].to_frame()

            count
CustomerID
C003           17
C001           17
C016           16
C020           14
C017           14
C002           12
C019           11
C008           11
C006           10
C005           10

In [17]:
# Adds the day name of the purchase

df['Day'] = df['Date'].dt.day_name()

df.head()

   OrderID       Date CustomerID  Product  Quantity  Price    Total       Day
0        1 2024-04-12       C002    Phone         1    600   642.09    Friday
1        2 2024-12-14       C003   Laptop         2   1000  2098.39  Saturday
2        3 2024-09-27       C017  Monitor         1    200   196.34    Friday
3        4 2024-04-16       C005    Phone         3    600  1955.86   Tuesday
4        5 2024-03-12       C017   Laptop         1   1000  1098.19   Tuesday

In [18]:
# Adds the month of the purchase

df['Month'] = df['Date'].dt.month_name()

df.head()

,OrderID,Date,CustomerID,Product,Quantity,Price,Total,Day,Month
0,1,2024-04-12,C002,Phone,1,600,642.09,Friday,April
1,2,2024-12-14,C003,Laptop,2,1000,2098.39,Saturday,December
2,3,2024-09-27,C017,Monitor,1,200,196.34,Friday,September
3,4,2024-04-16,C005,Phone,3,600,1955.86,Tuesday,April
4,5,2024-03-12,C017,Laptop,1,1000,1098.19,Tuesday,March

In [19]:
# Monthly Sales

monthly_sales = df.groupby('Month')['Total'].sum().sort_values(ascending=False).reset_index()
monthly_sales

        Month     Total
0    December  21722.82
1      August  18018.66
2    November  16908.88
3       April  15942.33
4     October  15905.58
5    February  15593.58
6         May  15425.28
7        June  15249.31
8        July  14710.40
9   September  14576.32
10      March  13793.66
11    January   8755.09

In [24]:
# average sales by day

daily_avg_sales = df.groupby('Day')['Total'].apply('mean').round(2).sort_values(ascending=False).reset_index()
daily_avg_sales

         Day    Total
0  Wednesday  1183.50
1   Thursday  1011.56
2     Monday   979.83
3   Saturday   942.26
4     Sunday   942.22
5    Tuesday   905.56
6     Friday   604.17